[
    {
      "category": "Slab Rough-In",
      "topic": "Overview",
      "title": "Phase 3: Slab & Foundation Rough-In (Commercial Electrical Boot Camp) - Overview",
      "content": "This knowledge document covers Phase 3 – the slab and foundation rough-in – as part of a series preparing electrical apprentices for General Foreman roles. It provides a detailed task checklist, materials list (with preferred brands), relevant code references (NEC and Chicago amendments), trade coordination tips, and common pitfalls to avoid. The goal is to ensure practical clarity for apprentice electricians aiming to fast-track into foreman positions.",
      "keywords": ["slab rough-in", "foundation", "commercial electrical", "apprentice", "foreman", "checklist", "materials", "code", "trade coordination", "pitfalls"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Under-Slab Conduit",
      "task": "Layout",
      "title": "Review Plans & Mark Layout",
      "content": "Thoroughly review electrical and architectural drawings to identify all conduits required under the slab (for power feeders, branch circuits, data/communications, floor boxes, future equipment, etc.). Mark the conduit routes on the subgrade or foundation forms according to the plan, verifying correct locations for floor outlets and stub-ups. Double-check measurements so that stub-ups will align within walls or floor box openings after the pour.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["conduit layout", "slab", "plans", "measurements", "floor boxes", "stub-ups"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Under-Slab Conduit",
      "task": "Installation",
      "title": "Install Conduits & Stub-Ups",
      "content": "Install conduit runs below or within the slab formwork as per layout. Maintain proper bending radius and use long sweeps where needed for easier wire pulls. Secure conduits in place with tie wire or nVent Caddy conduit clips to prevent movement. Ensure vertical stub-ups for floor boxes or equipment are plumb and braced (e.g. tied to rebar or form stakes) so they stay correctly positioned during the concrete pour. If multiple conduits rise in close proximity, space them adequately to accommodate their fittings and boxes without conflict.",
      "codeReferences": [],
      "materials": ["nVent Caddy conduit clips", "tie wire"],
      "keywords": ["conduit installation", "stub-ups", "bending radius", "wire pulls", "securing conduits"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Under-Slab Conduit",
      "task": "Depth and Cover",
      "title": "Depth & Cover",
      "content": "Position conduits near the bottom of the slab or in the sub-base as allowed, with sufficient concrete cover above them for protection. The NEC permits zero inches of cover under a building slab, but it is good practice to have a few inches of concrete above conduits for structural integrity and to fully encase them. Keep conduits below reinforcement (unless otherwise engineered) so they do not reduce the slab strength. Avoid clustering too many conduits tightly together; provide spacing between parallel runs to allow concrete to flow around each conduit and ensure proper encasement.",
      "codeReferences": ["NEC"],
      "materials": [],
      "keywords": ["conduit depth", "concrete cover", "slab strength", "conduit spacing"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Under-Slab Conduit",
      "task": "Floor Boxes",
      "title": "Floor Boxes",
      "content": "For each floor box location, install the box (or a block-out if the box will be inserted later) per manufacturer instructions. Use floor boxes listed for concrete pour applications, such as cast iron or PVC boxes with removable protective covers. Secure boxes to the formwork or rebar grid at the correct finished floor height. Verify that box openings will be flush with or just below the slab surface to accept finish covers after pour. Protect the interior of boxes and conduit openings with duct tape or foam plugs to keep concrete out.",
      "codeReferences": [],
      "materials": ["Raco floor boxes", "Garvin floor boxes", "duct tape", "foam plugs"],
      "keywords": ["floor boxes", "concrete pour", "installation", "protection"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Grounding and Bonding",
      "task": "Ufer Ground",
      "title": "Concrete-Encased Electrode (Ufer Ground)",
      "content": "Install a concrete-encased grounding electrode if the design or code requires it (most foundations will qualify). Typically, this involves bonding to the rebar in the footing or slab: use at least 20 feet of continuous #4 rebar (or bare #4 AWG copper) encased in the concrete near the bottom of the foundation as the electrode. Before the pour, attach a grounding electrode conductor (GEC) to this rebar Ufer electrode – for example, by an exothermic weld or a listed rebar clamp – per NEC 250.52(A)(3). Ensure the connection is secure and protected from displacement during the pour.",
      "codeReferences": ["NEC 250.52(A)(3)"],
      "materials": ["#4 AWG Copper", "nVent/Erico Cadweld", "Simpson Strong-Tie clamp"],
      "keywords": ["ufer ground", "rebar", "grounding", "bonding", "electrode"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Grounding and Bonding",
      "task": "Building Steel",
      "title": "Bonding to Building Steel",
      "content": "If structural steel columns or embeds are present in the concrete, arrange for bonding them to the grounding system as well. NEC 250.50 requires all building electrodes (rebar, structural steel, metal water pipes, etc.) that are present to be bonded together into a common grounding electrode system. Typically, a bonding jumper would be connected from the rebar electrode or main grounding bus to the building steel frame. This may involve a weld lug on a column or a listed bonding clamp. Coordinate with the steel/structural team so any required attachments (like a welding tab or accessible rebar stub) are in place before concrete is poured.",
      "codeReferences": ["NEC 250.50"],
      "materials": ["#4 AWG Copper"],
      "keywords": ["bonding", "building steel", "grounding", "structural steel", "electrode"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Grounding and Bonding",
      "task": "GEC Routing",
      "title": "Grounding Electrode Conductor Routing",
      "content": "Run the main GEC from the electrode (Ufer) to the electrical room or service equipment location. In Chicago, this GEC must be installed in a metal raceway (rigid metal conduit or EMT) for its entire length, so plan to stub-up a conduit from the slab that will carry the GEC up to the service ground bar or neutral bonding point. Keep GEC bends gradual and minimize splices. All splices or taps in the grounding electrode conductor, if any, should be made with irreversible connectors and must remain accessible – Chicago amendment requires such splices to be enclosed in an accessible metal box that is bonded.",
      "codeReferences": ["Chicago 14E-2-250"],
      "materials": ["RMC Conduit", "EMT Conduit"],
      "keywords": ["GEC", "grounding electrode conductor", "routing", "metal raceway", "splices"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Grounding and Bonding",
      "task": "Supplemental Electrodes",
      "title": "Supplemental Electrodes",
      "content": "Ensure any other required electrodes are in place. For example, if the building has a metal underground water service, it must be bonded. If ground rods or ground rings are specified in addition to the Ufer ground, those should be installed at this stage as well. All electrodes and bonding connections should be recorded for the inspector before concealment.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["supplemental electrodes", "ground rods", "ground rings", "bonding"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Grounding and Bonding",
      "task": "Inspection",
      "title": "Inspection",
      "content": "Coordinate with the inspector for a grounding electrode inspection if required (many jurisdictions want to see the Ufer ground connection and any bonding jumpers before the concrete pour, since afterward it will be inaccessible). This is crucial – an overlooked grounding inspection can lead to costly chiseling or exposure later.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["grounding inspection", "ufer ground", "bonding jumpers"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Vapor Barrier",
      "task": "Integrity",
      "title": "Maintain Vapor Barrier Integrity",
      "content": "Most slab-on-grade foundations include a plastic sheet vapor barrier (polyethylene) over the soil or sub-base. When installing conduits and ground wires, you will have to penetrate this barrier. Minimize openings by clustering conduits where feasible and cutting neat holes. After running conduits, seal the vapor barrier around all penetrations. Use a compatible tape or sealant to patch any slits made in the membrane and to tape around each conduit coming through the plastic. The goal is to restore a continuous vapor barrier to prevent moisture intrusion from the ground.",
      "codeReferences": [],
      "materials": ["3M Air and Vapor Barrier Tape", "Stego Tape"],
      "keywords": ["vapor barrier", "conduit penetration", "sealing", "moisture intrusion"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Vapor Barrier",
      "task": "Sleeves and Couplings",
      "title": "Sleeves and Couplings",
      "content": "If large groups of conduits penetrate the barrier in one area, consider installing a sleeve or block-out in the vapor barrier to consolidate the opening, then seal around it. Ensure that any method used is acceptable to the general contractor or inspector for vapor barrier continuity.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["vapor barrier sleeves", "conduit couplings", "sealing"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Vapor Barrier",
      "task": "Tearing/Displacement",
      "title": "Avoid Tearing/Displacement",
      "content": "Be careful when walking or working on the vapor barrier – it can tear easily. Do not allow rebar or tools to puncture it in unintended areas. If damage occurs, patch it promptly. This is often done in coordination with the concrete or general contractor, as an intact vapor barrier is also a building code requirement (for moisture control). A properly sealed barrier around all electrical conduits will also help with insect and radon resistance and maintain the slab’s performance.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["vapor barrier damage", "repair", "moisture control"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Conduit Spacing",
      "task": "Structural Requirements",
      "title": "Coordinate with Structural Requirements",
      "content": "Work closely with the structural drawings/engineer for any limitations on conduit size or placement in the slab. Large conduits or too many conduits in a small area can weaken concrete. Typically, avoid embedding conduits larger than about one-third the slab thickness and maintain at least 2 inches of concrete cover between the top of any conduit and the slab surface (unless the engineer allows otherwise). Space multiple conduits so that concrete can fully surround each one. As a rule of thumb, leave at least one conduit diameter (preferably more) of separation between parallel runs. If conduits must be bunched, consider using concrete additives or extra rebar reinforcement in that area per structural guidance.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["conduit spacing", "structural requirements", "concrete strength", "conduit size"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Conduit Spacing",
      "task": "Support and Security",
      "title": "Conduit Support and Security",
      "content": "Tie all conduits to rebar or support chairs at regular intervals to keep them at the correct elevation. This prevents the conduits from floating up or sagging when concrete is poured. Use plastic or metal chairs/spacers or just nylon tie wire every few feet to the rebar grid. Ensure no conduit is lying directly on the subgrade without support if the plans call for it to be in the middle of the slab thickness.",
      "codeReferences": [],
      "materials": ["nVent Caddy spacers", "tie wire"],
      "keywords": ["conduit support", "conduit security", "rebar", "elevation"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Conduit Spacing",
      "task": "Depth and Crossing",
      "title": "Depth and Crossing Utilities",
      "content": "If electrical conduits must cross plumbing or HVAC pipes under the slab, coordinate elevation so that one passes below the other with sufficient clearance. For instance, it’s common to run electrical conduits underneath large drain pipes if the drains need a higher slope. Maintain the required slope for plumbing and then route conduits either deeper or shallower accordingly, while still keeping electrical within allowable depth. Also, ensure conduits don’t interfere with any thickened slab areas or footings. If a conduit must penetrate a footing or grade beam, that usually requires a sleeve and structural sign-off.",
      "codeReferences": [],
      "materials": [],
      "keywords": ["conduit depth", "crossing utilities", "plumbing", "HVAC", "footings"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Conduit Spacing",
      "task": "Future Capacity",
      "title": "Future Capacity and Stub-Outs",
      "content": "As part of layout, consider future needs. A foreman-minded approach is to stub out any spare conduits or allow space for future circuits if the plans indicate possible expansions. For example, you might install an empty conduit for future use in an open area of the slab (capped and documented) to avoid coring later. Similarly, ensure that any necessary conduit for site lighting or exterior feeders that need to go out of the building are in place before the slab is poured (stubbed past the foundation edge). All such conduits must extend beyond the slab edge or foundation so they can be accessed later. Coordinate with civil/site plans for exit points through the foundation.",
      "codeReferences": ["NEC 300.5(C)"],
      "materials": [],
      "keywords": ["future capacity", "stub-outs", "conduit planning", "site lighting", "exterior feeders"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Pre-Pour Inspection",
      "task": "Final Prep",
      "title": "Pre-Pour Inspection & Prep",
      "content": "Do a thorough walkthrough to ensure everything is ready: all conduits are installed per plan, secured, and capped; all required grounding/bonding is in place and inspected; vapor barrier is sealed; and any potential conflicts with other trades have been resolved. Take photos or notes of critical dimensions for use later in case locations need to be verified after the pour. Once satisfied, sign off with the site supervisor that slab rough-in is complete and ready for concrete. Always be present or have a team member present during the pour to monitor that components remain in place and to address any issues (like a box that might get dislodged or a conduit that needs adjustment before the concrete sets).",
      "codeReferences": [],
      "materials": [],
      "keywords": ["pre-pour inspection", "concrete placement", "conduit installation", "grounding inspection", "vapor barrier"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "RMC Conduit",
      "title": "Rigid Metal Conduit (RMC)",
      "content": "Galvanized steel heavy-wall conduit for under-slab runs (Chicago requires RMC under slabs). Used for power and data raceways in concrete. Provides a robust, code-compliant raceway in wet concrete.",
      "codeReferences": [],
      "materials": ["Allied Tube", "Wheatland (Atkore)"],
      "keywords": ["RMC conduit", "galvanized steel", "under-slab", "power raceways", "data raceways"],
      "location": "Chicago",
      "size":"3/4\" or 1\" trade size",
      "quantity":"~100 ft per 100 ft of run. Couplings: ~10 per 100 ft. 90° elbows: ~2–4 per 100 ft of conduit run."
    },
      {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "PVC Conduit",
      "title": "Rigid PVC Conduit (if allowed)",
      "content": "Schedule 40 PVC conduit for underground runs outside building or when encased in concrete (NEC allowable; check local code – Chicago permits PVC only in direct burial or concrete encased outside the building). Often used for exterior feeders or branch circuits to site lighting.",
      "codeReferences": [],
      "materials": ["Carlon (ABB)", "Cresline"],
      "keywords": ["PVC conduit", "schedule 40", "underground runs", "exterior feeders", "site lighting"],
      "location": "Chicago",
      "size":"3/4\", 1\", 2\" etc. (trade size as required). 10 ft sticks with solvent couplings.",
      "quantity":"Per 100 ft run: 100 ft conduit, couplings ~10, PVC solvent cement ~1 pint per 100 ft. (If PVC >2\", use steel 90° elbows – 1 per bend)."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Conduit Supports",
      "title": "Conduit Supports & Ties",
      "content": "Devices to secure conduit to rebar or formwork, maintaining spacing and alignment. Prevents movement during concrete pour. Includes specialty clips and traditional tie wires.",
      "codeReferences": [],
      "materials": ["nVent Caddy conduit clips", "tie wire"],
      "keywords": ["conduit supports", "conduit ties", "rebar", "formwork"],
      "location": "Chicago",
      "size":"Sized to conduit (e.g. 3/4\" or 1\" clips). Tie wire in rolls.",
      "quantity":"~1 clip or tie every 4–5 ft of conduit. (~20–25 ties per 100 ft of conduit)."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Floor Boxes",
      "title": "Floor Boxes and Inserts",
      "content": "Floor outlet boxes designed for concrete pour, including box, cover, and leveling components. Provide power/data access in floor after slab is finished. Often PVC or cast metal boxes with adjustable tops.",
      "codeReferences": [],
      "materials": ["Raco floor boxes", "Garvin floor boxes", "Arlington Industries", "Legrand"],
      "keywords": ["floor boxes", "concrete pour", "power access", "data access"],
      "location": "Chicago",
       "size":"1-, 2-, or 4-gang floor box kits, typically 4\" to 6\" deep. Brass or steel cover plates.",
      "quantity":"Per installation"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Conduit Connectors",
      "title": "Conduit Connectors & Fittings",
      "content": "Miscellaneous fittings for raceways: couplings, connectors, elbows, bushings, etc. For RMC: threaded galvanized couplings and connectors; for PVC: solvent-weld couplings and adapters. Bushings protect wires at conduit ends.",
      "codeReferences": [],
      "materials": ["Ideal Industries connectors", "Appleton hubs", "O-Z/Gedney hubs", "3M bushings"],
      "keywords": ["conduit connectors", "conduit fittings", "couplings", "elbows", "bushings"],
      "location": "Chicago",
      "size":"1/2\" to 2\" sizes matching conduit.",
      "quantity":"Couplings: ~1 per 10 ft of conduit. Threaded plastic bushings: ~2 per conduit run. Locknuts: 2 per connector if entering metal box."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Grounding Conductor",
      "title": "Grounding Electrode Conductor (GEC)",
      "content": "Bare copper wire for bonding rebar (Ufer) and other electrodes, running to main panel ground. Installs under slab and up into equipment room.",
      "codeReferences": [],
      "materials": ["Southwire bare copper", "Ideal grounding accessories"],
      "keywords": ["GEC", "grounding electrode conductor", "bare copper wire", "ufer ground", "bonding"],
      "location": "Chicago",
      "size":"#4 AWG copper (for 200A–400A services; larger if required by code), or as engineered.",
      "quantity":"Typically 20 ft encased in concrete plus additional length to reach panel. Commonly, 1 run from footing to service (e.g. 50–100 ft)."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Rebar Clamps",
      "title": "Rebar Ground Clamps / Connectors",
      "content": "Connectors to bond copper GEC to rebar or building steel (forming the concrete-encased electrode bond). Must be listed for concrete encasement or direct burial if to be cast in concrete. Alternatively, exothermic weld materials.",
      "codeReferences": [],
      "materials": ["nVent Caddy/Erico rebar clamps", "Simpson Strong-Tie TGB connectors", "Burndy clamps", "nVent Cadweld"],
      "keywords": ["rebar clamps", "ground connectors", "ufer ground", "building steel", "exothermic weld"],
      "location": "Chicago",
      "size":"Clamp sized for rebar # (e.g. #4 rebar) and conductor size (#4–#6 AWG). Cadweld shots sized by connection type.",
      "quantity":"1 clamp per rebar ground location. Exothermic weld: 1 charge per connection (single-use)."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Vapor Barrier Tape",
      "title": "Vapor Barrier Tape/Sealant",
      "content": "Tape for patching vapor barrier around conduits and openings. Ensures continuity of the under-slab moisture barrier after penetrations.",
      "codeReferences": [],
      "materials": ["3M Air and Vapor Barrier Tape", "Stego Tape"],
      "keywords": ["vapor barrier tape", "vapor barrier sealant", "patching", "moisture barrier"],
      "location": "Chicago",
      "size":"4\" or 6\" wide rolls, 75–100 ft length.",
      "quantity":"~1 roll per 10–20 penetrations."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Powder Actuated",
      "title": "Powder-Actuated Fasteners",
      "content": "Fastener pins used with a powder-actuated tool (PAT) to secure items to concrete or steel. In slab rough-in, used to attach conduit straps or floor box forms to deck/formwork, or to secure temporary bracing.",
      "codeReferences": [],
      "materials": ["Ramset pins and charges", "Hilti cartridge nails", "DeWalt/Powers P.A.T. fasteners"],
      "keywords": ["powder actuated fasteners", "fastener pins", "conduit straps", "floor box forms"],
      "location": "Chicago",
      "size": "1\" to 2-1/2\" length pins. .22 cal or .27 cal charges.",
      "quantity":"As needed."
    },
    {
      "category": "Slab Rough-In",
      "topic": "Materials List",
      "task": "Anchor Bolts",
      "title": "Concrete Anchor Bolts & Inserts",
      "content": "Anchors for mounting equipment or panels to the concrete after it cures. (While not installed during rough-in, anchor bolts might be set in the concrete or inserts cast in place for future use.) For instance, slab-on-grade equipment pads may have anchor bolts.",
      "codeReferences": [],
      "materials": ["Simpson Strong-Tie wedge anchors", "Powers Fasteners / DeWalt wedge anchors", "Hilti KWIK bolts", "Cast-in-place J-bolts"],
      "keywords": ["concrete anchor bolts", "anchor inserts", "equipment pads", "mounting"],
      "location": "Chicago",
      "size":"3/8\" x 3\", 1/2\" x 4-1/2\", etc., or per equipment specs.",
      "quantity":"If preset in concrete: typically 4 anchor bolts per equipment pad. If post-installed: ~2–4 anchors per device."
    },
      {
      "category": "Slab Rough-In",
      "topic": "Code References",
      "task": "Under-Slab Raceways",
      "title": "Under-Slab Raceways – Depth and Protection",
      "content": "NEC Table 300.5 sets minimum burial depths for conduits. Under a building slab, the required cover is 0 inches. If using nonmetallic conduit (PVC) under a slab, NEC 300.5(C) requires it to be in a raceway that extends beyond the building’s outside walls. NEC 300.5(D)(4) further requires that raceways subject to physical damage (like where they emerge from the slab) must be of rigid metal, IMC, or Schedule 80 PVC for protection. Chicago Amendment: The Chicago Electrical Code is more restrictive on conduit type under slabs – it generally requires galvanized Rigid Metal Conduit (RMC) for any under-slab or in-foundation raceways. PVC conduit is only permitted in Chicago for direct burial outside the building or concrete-encased exterior runs, and even then it must transition to RMC before emerging from the ground. Chicago requires that nonmetallic conduit shall not emerge from below grade – any section coming up out of the ground or slab must be metal (rigid/IMC).",
      "codeReferences": ["NEC Table 300.5","NEC 300.5(C)","NEC 300.5(D)(4)","Chicago Electrical Code"],
      "materials": [],
      "keywords": ["under-slab raceways", "conduit depth", "conduit protection", "RMC", "PVC", "Chicago code"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Code References",
      "task": "Wet Location Wiring",
      "title": "Wet Location Wiring",
      "content": "All conduits run below grade or encased in concrete are considered “wet locations” by code. NEC 300.5(B) and Article 100 define that the interior of raceways in concrete or underground are wet locations. Practically, this means you must use conductors with insulation rated for wet conditions (e.g. THWN or XHHW) when you pull wires later. Chicago Amendment: Chicago’s code echoes this; an informational note in the Chicago Electrical Code explicitly states “a concrete slab in contact with the earth, or on the lowest level of a building is not a dry location.” So, ensure all your wiring methods under the slab are suitable for wet conditions (conduits properly sealed, and wires will be wet-rated).",
      "codeReferences": ["NEC 300.5(B)", "NEC Article 100", "Chicago Electrical Code"],
      "materials": ["THWN wire", "XHHW wire"],
      "keywords": ["wet location wiring", "conduits", "concrete", "underground", "wire insulation", "Chicago code"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Code References",
      "task": "Floor Boxes",
      "title": "Floor Boxes in Concrete Floors",
      "content": "NEC 314.27(B) (Floor Boxes) requires that boxes used for receptacles in the floor are specifically listed for that application. This means standard junction boxes are not acceptable for a flush floor outlet – you need a listed concrete-tight floor box assembly. In slab rough-in, ensure you are installing the correct listed floor box kit (with gaskets, covers, etc., often brass or aluminum covers that are “scrub water” tested). Chicago Amendment: Chicago follows the NEC on this point (no significant deviation in the Chicago code for floor boxes), so compliance with 314.27(B) is mandatory. Always secure the listing information for floor boxes on site for inspection, as inspectors may ask to verify that the box is listed for floor use and has the required ingress protection.",
      "codeReferences": ["NEC 314.27(B)"],
      "materials": [],
      "keywords": ["floor boxes", "concrete floors", "receptacles", "listed boxes", "Chicago code"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Code References",
      "task": "Ufer Ground Code",
      "title": "Grounding: Concrete-Encased Electrode (Ufer Ground)",
      "content": "NEC 250.50 and 250.52(A)(3) – The NEC requires that any concrete-encased electrode present (usually rebar in footing) must be bonded into the building’s grounding electrode system. A concrete-encased electrode is defined as at least 20 feet of continuous rebar (or copper conductor) encased in ≥2″ of concrete and in contact with earth. In slab rough-in, this means you must make use of the building foundation rebar for grounding if it’s available. Connect a grounding electrode conductor to the rebar (typically via exothermic weld or listed clamp before the pour). Chicago Amendment: Chicago adopts this but adds some stricter practices. Chicago Electrical Code 14E-2-250 requires all available grounding electrodes (building steel, water pipe, rebar, etc.) to be bonded together – in high-rise or large buildings, they even allow a common grounding electrode conductor system (sometimes called a “Hogan ground”) to tie all systems together. For typical projects, key Chicago differences are: (a) Grounding electrode conductors must be run in metal conduit (RMC/IMC or EMT) for physical protection, even if the NEC would allow a free-run wire; and (b) all splices on a grounding electrode conductor must be irreversible and enclosed in a bonded metal box – you cannot just bury a split-bolt in concrete or underground as NEC might allow by exothermic weld. This means your Ufer ground connection in Chicago should either be a direct weld/clamp with an unbroken GEC to the panel, or if spliced, it should terminate in an accessible metal box (with exothermic or crimp inside).",
      "codeReferences": ["NEC 250.50", "NEC 250.52(A)(3)", "Chicago 14E-2-250"],
      "materials": [],
      "keywords": ["ufer ground", "grounding", "concrete-encased electrode", "rebar", "Chicago code", "GEC"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Code References",
      "task": "Rebar Bonding",
      "title": "Bonding of Rebar and Metal Piping",
      "content": "NEC 250.64(C) & 250.68 cover the connection of grounding electrode conductors to electrodes like rebar. Notably, NEC 250.68(A) Exception No.2 permits a rebar-to-GEC exothermic weld to be buried in concrete (it’s considered inherently accessible to inspection if done before pour) – this is a common way to make the Ufer connection without an access point. If using a clamp that is not rated for direct burial in concrete, then the end of the rebar with the clamp should stub out into a box for access. Chicago Amendment: Chicago is likely to require that any such connection that is not permanent (like a weld) be brought to an accessible point. It’s good practice in Chicago to stub out a piece of rebar to a metallic outlet box (with a bonding bushing) or use a listed rebar grounding connector that mounts in an accessible box at the slab surface, to satisfy the requirement for accessibility of that grounding connection. Additionally, Chicago may require bonding of all metal piping in or below the slab (for example, if a metal plumbing pipe is embedded in the slab, it should be bonded) – this mirrors NEC 250.104 which requires bonding of metal water pipes and structural metal. Ensure any such bonding is done during rough-in (e.g. attach a bonding jumper to a rebar that will clamp onto the metal plumbing pipe, so it’s in place before concrete).",
      "codeReferences": ["NEC 250.64(C)", "NEC 250.68", "NEC 250.104"],
      "materials": [],
      "keywords": ["rebar bonding", "metal piping", "grounding electrode conductors", "exothermic weld", "Chicago code"],
      "location": "Chicago"
    },
    {
      "category": "Slab Rough-In",
      "topic": "Code References",
      "task": "Conduit Fill",
      "title": "Conduit Fill and Grouping Considerations",
      "content": "While laying multiple conduits in a slab, be mindful of code rules on raceway fill and derating. NEC 310.15(C) (former 310.15(B)(3)) requires derating of conductors if more than 3 current-carrying conductors share a conduit, but in slab rough-in each circuit usually has its own conduit. For future wire pulls, ensure conduits are sized according to NEC Chapter 9, Table 1 for maximum fill percentages (40% for 1 wire, 31% for 2 wires, 40% for 3+ wires). Chicago Amendment: Chicago follows NEC fill calculations, but inspectors may scrutinize conduit fill more closely, especially for service conductors. Plan ahead by installing slightly larger conduits than minimum required to allow for future expansion.",
      "codeReferences": ["NEC 310.15(C)", "NEC Chapter 9, Table 1", "Chicago Electrical Code"],
      "materials": [],
      "keywords": ["conduit fill", "derating", "raceway", "wire sizing", "Chicago code"],
      "location": "Chicago"
    }
]